// პირველი დავალება

// შექმენით ალგორითმი რომელიც კონსოლში დალოგაბს გამრავლების ტაბულას

// კოდი



// function newElement (a , b) {

//     return a * b
// }

// console.log(newElement (4,16));

// --------------------------------------------


// მეორე დავალება 

// შექმენით ალგორითმი რომელიც კონსოლში დაბეჭდავს ყველა ლუწ რიცხვს 0 დან 20 მდე

// კოდი


// // let items = [0,1,2,3,4,5,6,7,8,9,10,11,12,14,15,16,17,18,19,20];

// for (let i = 0; i < items.length; i++) {

//     if (i % 2 === 0) {

//         console.log(i);
//     }

// }

// -----------------------------------------------


// მესამე დავალება

// შექმენით ალგორითმი რომელიც დაითვლის თუ რამდენი 4 ის ჯეადი რიცხვია მოთავსებული 0 დან 120 მდე

// კოდი


// function number (item) {

// let newNUmber = [];

// for (let i = 4; i < item ; i++) {


//     if (i % 4 ===0) {

//         newNUmber.push (i)
        
//     }

// }
    
//     return newNUmber.length 

// }


// console.log(number (120));


// --------------------------------------



// მეოთხე დავალება

// შექმენით ალგორითმი რომელიც დაითვლის თუ რამდენი გამყოფი აქვს მომხმარებლის მიერ შემოტანილ რიცხვს

// კოდი

// function newItem (element) {

//     let division = [];

//     for (let i = 0; i < element+1; i++) {

//         if (element % i === 0) {
//             division.push (i)
//         }
//     }

//     return division.length
// }

// console.log(newItem (10));



// ----------------------------------------


// მეხუთე დავალება

// შექმენით ალგორითმი რომელიც დაბეჭდავს რიცხვებს მომხმარებლის მიერ შემოყვანილ რიცხვებს შორის 

// კოდი


// function newnumber (a , b) {


  
//          for (let i = a + 1; i < b; i++) {
        
//             console.log(i);
    
//         }
    
//     }

// console.log(newnumber (5, 10));


// -----------------------------------------------
