
// დავალება #1
// რამდენი ტიპის მონაცემები გვაქვს ჯავასკრიპტში. ჩამოთვალეთ ისინი.(5ქ)

//  String
//  Number
//  Boolean
//  Undefined
//  Null
//  Symbol


//   function
//   array
//   objact

// ----------------------------------------

// დავალება #2
// რა სხვაობაა კომპილაციასა და ინტერპრეტაციას შორის?(10ქ)

// კომპილაცია არის რომელიც გარდაქმნის მაღალი დონის კოდს, რომელიც დაწერილია დეველოპერების მიერ,  კომპიუტერის  ენაზე, რომელიც ადვილად გასაგები და შესრულებული იქნება პროცესორის მიერ.
// ინტერპრეტაცის მეშვეობით ხდება დაწერილი კოდის გასაგებ ენაზე გადათარგმნა.

// ------------------------------------

// დავალება #3
// რა სხვაობაა == და === შორის?(5ქ))

// == უყურებს მხოლოდ value და === უყურებს როგორც value ასევე type

// ------------------------------

// დავალება #4
 // დაწერეთ როგორ ჩაიწერება ლოგიკური ოპერაციები კონიუნქცია(“და”) და 
// დიზუნქცია(“ან”) პროგრამულ ენაში? (5ქ)

// და &&  ,   ან ||

// -----------------------------

// დავალება #4
// რას დაბეჭდავს ეს ოპერაცია?(5ქ)

// var number1 = '12'
// var number2 = '8'
// var restult = number1 + number2
// console.log(`The result is ${restult} `)

// ა) The result is result
// ბ)The result is 20
// გ)The result is ${result}
// დ)The result is 128  სწორი პასუხია (დ)
// ე)128

// --------------------------------------

// დავალება #5
// რას დაბეჭდავს ეს ოპერაცია?(5ქ)

// var number1 = '12'
// var number2 = 8
// var restult = number1 + number2
// console.log(`The result is  ${restult} `)

// ა) The result is result
// ბ)The result is 20
// გ)The result is ${result}
// დ)The result is 128   სწორი პასუხია (დ)
// ე)128

// ------------------------------------


// დავალება #5
// რას დაბეჭდავს ეს კოდი იმ შემთხვევაში თუ მომხამრებელი შეიყვანს 1000ს? 2000ს? 
// 3000ს? ნებისმიერ სხვა რიცხვს? (15ქ)

// var mySalary = prompt ('შეიყვანეთ თქვენი ხელფასი');
//  switch (mySalary) {
//   case "1000":
//  console.log("თქვენ გაქვთ შემოსავალი -1000ლარი");
//  break;
//   case "2000":
//  console.log("თქვენ გაქვთ შემოსავალი -2000ლარი");
//  break;
//   case "3000":
//  console.log("თქვენ გაქვთ შემოსავალი -3000ლარი");
//  break;
//   default:
//  console.log("თქვენ გაქვთ შემოსავალი არასწორი");
 
// }

// 1000 შემთხვევაში პასუხი იქნება --- "თქვენ გაქვთ შემოსავალი -1000ლარი"
// 2000 შემთხვევაში პასუხი იქნება --- "თქვენ გაქვთ შემოსავალი -2000ლარი"
// 3000 შემთხვევაში პასუხი იქნება --- "თქვენ გაქვთ შემოსავალი -3000ლარი"
// სხვა დანარჩენ შემთხვევაში პასუხი იქნება --- "თქვენ გაქვთ შემოსავალი არასწორი"


// ------------------------------------

// დავალება #6
// დაწერეთ პროგრამა, რომელიც დაგიბეჭდავთ 50დან 100ის ჩათვლით (50<x<=100) 
// ყველა რიცხვს, რომელიც არის 5ის ან 10ის ჯერადი.(20ქ)

// function newItem (item) {

//     for(let i = 50; i < item + 1; i++) {

//         if (i % 5 === 0 || i % 10 === 0) {
//             console.log(i);
//         }
//     }
// }

// newItem (100) ;

// -----------------------------

// დავალება #7
// თხოვეთ მომხმარებელს შემოიტანოს რიცხვი 0-დან 100-მდე თუ რიცხვი მეტია 100-ზე ან
// ნაკლებია 0-ზე სთხოვეთ ახლიდან შემოტანა

// function newNumber (item) {

     
//         if ( item > 100 || item < 0) {
            
//             console.log('გთხოვთ ახლიდან შემოიტანოთ თანხა');

            
//          }  else {
//             for (let i = 0; i < item; i++)

//             console.log(i);
//          }
         
// }

//     newNumber (117);


// -----------------------------------------------


// დავალება #8
// დაბეჭდეთ ყველა რიცხვი 0დან მომხარებლის რიცხვამდე შეტანილის ჩათვლით, გარდა 
// იმ რიცხვებისა, რომლებიც 3ზე და 9ზე იყოფა. (30ქ)


// function newElements (item) {

//     for (let i = 0; i < item; i++) {
        
//         if (i % 3 !== 0 && i % 9 !== 0 ) {
//             console.log(i);
//         }

//     }

// }

// newElements (30)


// ---------------------------------