
// დავალება #1

// Შექმენით ფუნქცია რომელსაც პარამეტრების სახით გადასცემთ მასივს,
//  და ეს ფუნქცია შეავსებს მასივს 20 ცალი რენდომული რიცხვით. დააბრუნეთ ეს მასივი

// function randomNumbers(arr) {
//     for (var i = 0; i < 20; i++) {
//       arr[i] = Math.floor(Math.random() * 100);
//     }
//     return arr;
//   }

//   console.log(randomNumbers([]));

// ------------------------------------------------------


// დავალება #2

// Შექმენით ფუნქცია რომელსაც პარამეტრების სახით გადასცემთ მასივს და რაოდენობას, 
// და ეს ფუნქცია შეავსებს მასივს იმ რაოდენობის რენდომ რიცხვით რაც არგუმენტად გადაეცით. დააბრუნეთ ეს მასივი.

// function randomNumbers(arr, num) {
//     for (var i = 0; i < num; i++) {
//       arr[i] = Math.floor(Math.random() * 100);
//     }
//     return arr;
//   }

//   console.log(randomNumbers([], 10));


// ----------------------------------------------------------


// დავალება #3

// Შექმენით ფუნქცია რომელსაც პარამეტრების სახით გადასცემთ 20 ცალი რენდომული რიცხვისგან შევსებულ
//  მასივს და ეს ფუნქცია დაბეჭდავს ამ მასივში მოთავსებულ ყველა ლუწ რიცხვს

// function evenNumbers(arr) {

//     let newNumber = []
//     for (var i = 0; i < 20 ; i++) {

//         arr[i] = Math.floor(Math.random() * 100);

//         if (arr[i] % 2 === 0 ) {

//             newNumber.push (arr[i])
//         }
//     }

//     return newNumber
//   }

 

//   console.log(evenNumbers ([]));


// -------------------------------------------------

// დავალება #4

// Შექმენით ფუნქცია რომელსაც პარამეტრების სახით გადასცემთ 20 ცალი რენდომული რიცხვისგან შევსებულ მასივს 
// და ეს ფუნქცია ამოარჩევს ყველა 3 ის ჯერად რიცხვს და გადაწერს მათ მეორე მასივში რომელსაც დააბრუნებს ეს ფუნქცია


    // function evenNumbers(arr) {

    //     let newNumber = []
    //     for (var i = 0; i < 20 ; i++) {
    
    //         arr[i] = Math.floor(Math.random() * 100);
    
    //         if (arr[i] % 3 === 0 ) {
    
    //             newNumber.push (arr[i])
    //         }
    //     }
    
    //     return newNumber
    //   }
    
     
    
    //   console.log(evenNumbers ([]));


    // -------------------------------------------------


    // დავალება #5

    // გაქვთ შემდეგი მასივი: ['Vakhtang', 'Ani', "Giorgi', "Irakli', 'Levani']
    // იპოვეთ გიორგის ინდექსი და იქიდან ბოლომდე, დაასლაისეთ ელემენტები და დაბეჭდეთ ეკრანზე

    // let arr = ['Vakhtang', 'Ani', 'Giorgi', 'Irakli', 'Levani'];
    // let arrIndex = arr.indexOf('Giorgi');
    // let arrSliced = arr.slice(arrIndex);
    // console.log(arrSliced);
    

// ----------------------------------------------------


    // დავალება #6

    // გაქვთ შემდეგი ტიპის მასივი. [1, 5, 10, 13]
    // იპოვეთ 10ის ინდექსი და იქ ჩასვით 11 და 12.  (splice)



    // let arr = [1, 5, 10, 13];
    // let arrIndex = arr.indexOf(10);
    // arr.splice(arrIndex + 1, 0, 11, 12);
    // console.log(arr);

